In exercise folder (same level as this notebook on github) there is hiring.csv. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

In [37]:
# Loading the data
url = 'https://raw.githubusercontent.com/codebasics/py/master/ML/2_linear_reg_multivariate/Exercise/hiring.csv'

In [38]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
from sklearn.linear_model import LinearRegression

In [39]:
df=pd.read_csv(url)

In [40]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [43]:
# handling the null values
import math
test_mean =math.floor(df['test_score(out of 10)'].mean())
test_mean

7

In [44]:
df['test_score(out of 10)'].fillna(test_mean,inplace=True)

In [45]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [47]:
# handling the categorical feature
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  6 non-null      object
 1   test_score(out of 10)       8 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 384.0+ bytes

In [49]:
! pip install word2number

Collecting word2number
  Using cached word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5591 sha256=a21860295fd3b215e46f92454e4de6a8236b7931347b488bc2274c9462e2ef0e
  Stored in directory: c:\users\icon\appdata\local\pip\cache\wheels\4b\c3\77\a5f48aeb0d3efb7cd5ad61cbd3da30bbf9ffc9662b07c9f879
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

In [51]:
from word2number import w2n
df['experience'].fillna('zero',inplace=True)

In [52]:
df.head(3)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000

In [53]:
df['experience']  = df['experience'].apply(w2n.word_to_num)

In [60]:
df.head(2)

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000

In [62]:
# creating independent and dependent features

x_ind = df[['experience','test_score(out of 10)','interview_score(out of 10)']]
y_dep = df['salary($)']

In [63]:
obj =LinearRegression()

In [64]:
obj.fit(x,y)

LinearRegression()

In [69]:
# Que-1 
p =obj.predict([[2,9,6]])[0]
print('2 yr experience, 9 test score, 6 interview score = ',p)

2 yr experience, 9 test score, 6 interview score =  53713.86677124005

In [70]:
# Que-2 
q =obj.predict([[12,10,10]])[0]
print('12 yr experience, 10 test score, 10 interview score = ',q)

12 yr experience, 10 test score, 10 interview score =  93747.79628650834